In [4]:
def data(name):
    namelist=["ram","ajay","saloni","geeta","monika","rekha","rahul"]
    if name in namelist:
        return True
    else:
        return False

sequence=input("Enter the names:").split()
filtered=filter(data,sequence)
print(filtered)

Enter the names: mahesh rajesh ram geeta monika ajay rahul deepak saloni ramesh

<filter object at 0x000001249E496470>

In [2]:
list(filtered)

['ram', 'geeta', 'monika', 'ajay', 'rahul', 'saloni']

In [3]:
for k in filtered:
    print(k)

In [5]:
for k in filtered:
    print(k)

ram
geeta
monika
ajay
rahul
saloni

In [6]:
l=[12,11,23,34,45,5,6,56,78,89,90,33,44,564,76,87,9,4,3,2,5,6,8]
print(l,type(l))

[12, 11, 23, 34, 45, 5, 6, 56, 78, 89, 90, 33, 44, 564, 76, 87, 9, 4, 3, 2, 5, 6, 8] <class 'list'>

In [7]:
even=filter(lambda no:no%2==0,l)
print("Even list are:",list(even))
odd=filter(lambda no:no%2!=0,l)
print("Odd list are:",list(odd))

Even list are: [12, 34, 6, 56, 78, 90, 44, 564, 76, 4, 2, 6, 8]
Odd list are: [11, 23, 45, 5, 89, 33, 87, 9, 3, 5]

In [8]:
teen=filter(lambda x:x<18,l)
print("Teenager are:",list(teen))
youn=filter(lambda x:x>=18 and x<=30,l)
print("Younger are:",list(youn))
elder=filter(lambda x:x>30,l)
print("Elder are:",list(elder))

Teenager are: [12, 11, 5, 6, 9, 4, 3, 2, 5, 6, 8]
Younger are: [23]
Elder are: [34, 45, 56, 78, 89, 90, 33, 44, 564, 76, 87]

In [10]:
name=input("Enter the names:").split()
dob=list(map(int,input("Enter the dob:").split()))
status=input("Enter the status:").split()
address=input("Enter the address:").split()

Enter the names: Naresh Geetanjali Monu Alka Ojaswita Ravi Tara
Enter the dob: 1947 1951 1975 1976 2000 2002 1980
Enter the status: GrandFather GrandMother Father Mother Daughter Son Aunty
Enter the address: Ganganagar Ganganagar Ajmer Ajmer Delhi Bikaner Bangalore

In [11]:
data={"Name":name,"Dob":dob,"Status":status,"Address":address}
import pandas as pd
df=pd.DataFrame(data)
print(df,type(df))

         Name   Dob       Status     Address
0      Naresh  1947  GrandFather  Ganganagar
1  Geetanjali  1951  GrandMother  Ganganagar
2        Monu  1975       Father       Ajmer
3        Alka  1976       Mother       Ajmer
4    Ojaswita  2000     Daughter       Delhi
5        Ravi  2002          Son     Bikaner
6        Tara  1980        Aunty   Bangalore <class 'pandas.core.frame.DataFrame'>

In [12]:
df

         Name   Dob       Status     Address
0      Naresh  1947  GrandFather  Ganganagar
1  Geetanjali  1951  GrandMother  Ganganagar
2        Monu  1975       Father       Ajmer
3        Alka  1976       Mother       Ajmer
4    Ojaswita  2000     Daughter       Delhi
5        Ravi  2002          Son     Bikaner
6        Tara  1980        Aunty   Bangalore

In [13]:
df["Dob"]

0    1947
1    1951
2    1975
3    1976
4    2000
5    2002
6    1980
Name: Dob, dtype: int64

In [14]:
df["Age"]=df["Dob"].apply(lambda x:2025-x)

In [15]:
df

         Name   Dob       Status     Address  Age
0      Naresh  1947  GrandFather  Ganganagar   78
1  Geetanjali  1951  GrandMother  Ganganagar   74
2        Monu  1975       Father       Ajmer   50
3        Alka  1976       Mother       Ajmer   49
4    Ojaswita  2000     Daughter       Delhi   25
5        Ravi  2002          Son     Bikaner   23
6        Tara  1980        Aunty   Bangalore   45

In [16]:
df["Status"]

0    GrandFather
1    GrandMother
2         Father
3         Mother
4       Daughter
5            Son
6          Aunty
Name: Status, dtype: object

In [17]:
df["Gender"]=df["Status"].apply(lambda x:"Male" if x=="GrandFather" or x=="Father" or x=="Son" else "Female")

In [18]:
df

         Name   Dob       Status     Address  Age  Gender
0      Naresh  1947  GrandFather  Ganganagar   78    Male
1  Geetanjali  1951  GrandMother  Ganganagar   74  Female
2        Monu  1975       Father       Ajmer   50    Male
3        Alka  1976       Mother       Ajmer   49  Female
4    Ojaswita  2000     Daughter       Delhi   25  Female
5        Ravi  2002          Son     Bikaner   23    Male
6        Tara  1980        Aunty   Bangalore   45  Female

In [19]:
df["Gender"]=df["Status"].apply(lambda x:"Male" if x in ("GrandFather","Father","Son") else "Female")

In [20]:
df

         Name   Dob       Status     Address  Age  Gender
0      Naresh  1947  GrandFather  Ganganagar   78    Male
1  Geetanjali  1951  GrandMother  Ganganagar   74  Female
2        Monu  1975       Father       Ajmer   50    Male
3        Alka  1976       Mother       Ajmer   49  Female
4    Ojaswita  2000     Daughter       Delhi   25  Female
5        Ravi  2002          Son     Bikaner   23    Male
6        Tara  1980        Aunty   Bangalore   45  Female

In [24]:
df["State"]=df["Address"].map(lambda x:"Outofrajasthan" if x in ("Delhi","Bangalore") else "Rajasthan")

In [25]:
df

         Name   Dob       Status     Address  Age  Gender           State
0      Naresh  1947  GrandFather  Ganganagar   78    Male       Rajasthan
1  Geetanjali  1951  GrandMother  Ganganagar   74  Female       Rajasthan
2        Monu  1975       Father       Ajmer   50    Male       Rajasthan
3        Alka  1976       Mother       Ajmer   49  Female       Rajasthan
4    Ojaswita  2000     Daughter       Delhi   25  Female  Outofrajasthan
5        Ravi  2002          Son     Bikaner   23    Male       Rajasthan
6        Tara  1980        Aunty   Bangalore   45  Female  Outofrajasthan

In [31]:
per=lambda obt_marks=67,total_marks=100:print(round((obt_marks/total_marks)*100),"%")

In [33]:
per()

67 %